#include<iostream>
using namespace std;

int main() {

	//1.加減乘除
	int a1 = 10;
	int b1 = 3;

	cout << a1 + b1 << endl;
	cout << a1 - b1 << endl;
	cout << a1 * b1 << endl;
	cout << a1 / b1 << endl;
	//兩數相除 結果依然是整數,將小數部分去除

	int a2 = 10;
	int b2 = 20;

	cout << a2 / b2 << endl;

	int a3 = 10;
	int b3 = 0;

	//cout << a3 / b3 << endl; //錯誤!! 兩個數相除,除數是不可以為0的
//--------------------------------------------------------------------------	
	//2.小數相除
	double d1 = 0.5;
	double d2 = 0.22;
	cout << d1 / d2 << endl; //運算結果也可以是小數
//-------------------------------------------------------------------------	
	//1.取模運算的本質 就是求於數
	int c1 = 10;
	int c2 = 3;

	cout << c1 % c2 << endl; //=1

	int e1 = 10;
	int e2 = 20;

	cout << e1 % e2 << endl; //=10

	//int a3 = 10;
	//int b3 = 0;
	//兩樹相除除數不可以為0,所以也做不了取模運算
	//cout << a3 % b3 << endl;----錯誤!----

	//兩個小數是不可以作取模運算的
	double d3 = 3.14;
	double d4 = 1.1;

	//cout << d3 % d4 << endl;----錯誤!----
//-------------------------------------------------------------------------
	//1.前置遞增
	int A = 10;
	++A;
	cout << "A =" << A << endl;

	//2.後置遞增
	int B = 10;
	B++;
	cout << "B =" << B << endl;

	//3.前置和後置的區別

	//--前置遞增 先讓變量+1 然後進行表達運算--
	int A2 = 10;
	int B2 = ++A2 * 10;
	cout << "A2 =" << A2 << endl;
	cout << "B2 =" << B2 << endl;

	//--後置遞增 先進行表達運算 後讓變量+1--
	int A3 = 10;
	int B3 = A3++ * 10;
	cout << "A3 =" << A3 << endl;
	cout << "B3 =" << B3 << endl;

	//---------------------------------------------------------------------------
		//賦值運算符

		// =
	int s = 10;
	s = 50;
	cout << "s =" << s << endl;

	// +=
	s = 10;
	s += 2;  //s = s + 2;
	cout << "s =" << s << endl;

	// -=
	s = 10;
	s -= 2;  //s =  s - 2;
	cout << "s =" << s << endl;

	// *=
	s = 10;
	s *= 2; //s = s * 2;
	cout << "s =" << s << endl;

	// /=
	s = 10;
	s /= 2; //s = s / 2;
	cout << "s =" << s << endl;

	// %=
	s = 10;
	s %= 3; //s = s % 3;
	cout << "s =" << s << endl;

	//--------------------------------------------------------------------------
		//比較運算符

		// ==    ==true 如果兩個運算元具有相同的值，則等於運算子 () 會傳回，否則會傳回 false
	int p = 10;
	int o = 20;
	cout << (p == o) << endl;

	// !=    !=true 如果運算元的值不相同，則不等於運算子 () 會傳回，否則會傳回 false 
	cout << (p != o) << endl;

	// >	 大於 
	cout << (p > o) << endl;

	// <	 小於
	cout << (p < o) << endl;

	// >=	 大於或等於 
	cout << (p >= o) << endl;

	// <=	 小於或等於
	cout << (p <= o) << endl;
	//---------------------------------------------------------------------------
		//邏輯運算符  [非 !]
	int n = 10;
	//在C++中 除了0 都為真
	cout << !n << endl; //0

	cout << !!n << endl; //1

	//邏輯運算符  [與 &&]
	int y = 10;
	int z = 10;

	cout << (y && z) << endl;

	y = 0;
	z = 10;

	cout << (y && z) << endl;

	y = 0;
	z = 0;

	cout << (y && z) << endl;

	//同真為真 其餘為假
//------------------------------------------------------------------------
	//邏輯運算符 [或 ||]

	int q = 10;
	int u = 10;

	cout << (q || u) << endl;

	q = 0;
	u = 10;

	cout << (q || u) << endl;

	q = 0;
	u = 0;

	cout << (q || u) << endl;

	//邏輯或:同假為假 其餘為真
//----------------------------------------------------------------------
	//條件運算符 [?:]
	int i = 1, j = 2;
	cout << (i > j ? i : j) << " is greater." << endl;

	//條件運算子 (？：) 是三元運算子 (它會採用三個運算元)
	//如果第一個運算元評估為 true 則會評估第二個運算元
	//如果第一個運算元評估為 false 則會評估第三個運算元




	//選擇結構 單行if語句
	//用戶輸入分數 如果分數大於600 視為考上一本大學 在屏幕上輸出

	//user輸入分數
	int score = 0;
	cout << "起輸入一個分數:" << endl;
	cin >> score;

	//打應user輸入的分數
	cout << "你輸入的分數為:" << score << endl;

	//判斷分數是否大於600 如果大於 那麼輸出
	if (score > 600)
	{
		cout << "恭喜您考上一本大學" << endl;
	}
	//注意事項 if條件後面布要加分號
//---------------------------------------------------------------------------
	//選擇結構 多行if語句

	//用戶輸入分數 如果分數大於600 視為考上一本大學 在屏幕上輸出 
	//如果沒考上一本大學 打印沒有考上一本大學

	//輸入考試分數
	int score1 = 0;
	cout << "請輸入你的分數:" << endl;
	cin >> score1;

	cout << "你輸入的分數為:" << score1 << endl;

	//判斷 如果大於600 打印考上一本 否則打印沒考上一本
	if (score1 > 600)
	{
		cout << "恭喜您考上一本大學" << endl;
	}
	else     //不大於600分 執行else後大括號中的內容
	{
		cout << "未考上一本大學" << endl;
	}
	//-----------------------------------------------------------------------------
		//選擇結構 多條件if語句

		//輸入考試分數 如過大於600分 視為考上一本大學 在屏幕中輸出
		//大於500 視為考上二本大學 在屏幕中輸出
		//大於400 視為考上三本大學 在屏幕中輸出
		//小於等於於400 視為末考上本科 在屏幕中輸出


	//選擇結構 單行if語句
	//用戶輸入分數 如果分數大於600 視為考上一本大學 在屏幕上輸出

		//user輸入分數
	int score3 = 0;
	cout << "請輸入你的分數:" << endl;
	cin >> score3;

	cout << "你輸入的分數為:" << score3 << endl;

	//判斷
	if (score3 > 600)
	{
		cout << "恭喜您考上一本大學" << endl;
	}
	else if (score3 > 500)
	{
		cout << "恭喜您考上二本大學" << endl;
	}
	else if (score3 > 400)
	{
		cout << "恭喜您考上三本大學" << endl;
	}
	else
	{
		cout << "未考上本科 請再接再厲" << endl;
	}
	//---------------------------------------------------------------------------------
		//輸入考試分數 如過大於600分 視為考上一本大學 在屏幕中輸出
		//大於700 北大
		//大於650 清華
		// 其餘   人大
		//大於500 視為考上二本大學 在屏幕中輸出
		//大於400 視為考上三本大學 在屏幕中輸出
		//小於等於於400 視為末考上本科 在屏幕中輸出


		//user輸入分數
	int score2 = 0;
	cout << "請輸入高考的分數:" << endl;
	cin >> score2;

	cout << "你輸入的高考分數為:" << score2 << endl;

	//判斷
	if (score2 > 600)
	{
		cout << "恭喜您考上一本大學" << endl;
		if (score2 > 700)
		{
			cout << "恭喜您能考入北京大學" << endl;
		}
		else if (score2 > 650)
		{
			cout << "恭喜您能考入清華大學" << endl;
		}
		else
		{
			cout << "恭喜您能考入人民大學" << endl;
		}
	}
	else if (score2 > 500)
	{
		cout << "恭喜您考上二本大學" << endl;
	}
	else if (score2 > 400)
	{
		cout << "恭喜您考上三本大學" << endl;
	}
	else
	{
		cout << "未考上本科 請再接再厲" << endl;
	}


	system("pause");

	return 0;

}